tests/Unit/EInvoiceClient/EInvoiceTestInput01.json

{
    "msg": "執行成功",
    "code": "200",
    "invNum": "MH25570631",
    "invoiceTime": "00:00:33",
    "invStatus": "已確認",
    "sellerName": "旱溪夜市站",
    "invPeriod": "10802",
    "sellerAddress": "",
    "sellerBan": "72452657",
    "buyerBan": "",
    "currency": "",
    "details": [
        {
            "unitPrice": "50",
            "amount": "50",
            "quantity": "1",
            "rowNum": "001",
            "description": "停車費"
        }
    ],
    "invDate": "20190119"
}